* Load the input data into a table

Convert input into a csv file

#+begin_src awk :in-file ../../input/day03/input.txt :results value file :file rucksacks.csv
  BEGIN {
      rucksack_id = 1
  }

  {
    compartment_size = length($0) / 2
    split(substr($0, 0, compartment_size), compartment_1, "")
    split(substr($0, compartment_size+1), compartment_2, "")

    for (i=1; i <= compartment_size; i++) {
      printf("%d,%d,%d,%s\n", rucksack_id, 1, i, compartment_1[i])
    }
    for (i=1; i <= compartment_size; i++) {
      printf("%d,%d,%d,%s\n", rucksack_id, 2, i, compartment_2[i])
    }
    rucksack_id++
  }
#+end_src

#+RESULTS:
[[file:rucksacks.csv]]


Load the csv file into sqlite

#+begin_src sqlite :db ./day03.db
  drop table if exists rucksacks;	
  create table rucksacks(rucksack_id int, compartment_id int, item_id int, item string);
  .mode csv rucksacks
  .import rucksacks.csv rucksacks
#+end_src

#+RESULTS:

#+begin_src sqlite :db ./day03.db :colnames yes :exports both
  select * from rucksacks where rucksack_id = 3
#+end_src

#+RESULTS:
| rucksack_id | compartment_id | item_id | item |
|-------------+----------------+---------+------|
|           3 |              1 |       1 | Z    |
|           3 |              1 |       2 | r    |
|           3 |              1 |       3 | z    |
|           3 |              1 |       4 | p    |
|           3 |              1 |       5 | W    |
|           3 |              1 |       6 | z    |
|           3 |              1 |       7 | f    |
|           3 |              1 |       8 | b    |
|           3 |              1 |       9 | p    |
|           3 |              1 |      10 | Q    |
|           3 |              1 |      11 | p    |
|           3 |              1 |      12 | W    |
|           3 |              1 |      13 | b    |
|           3 |              1 |      14 | z    |
|           3 |              1 |      15 | v    |
|           3 |              1 |      16 | Z    |
|           3 |              1 |      17 | W    |
|           3 |              1 |      18 | Z    |
|           3 |              2 |       1 | p    |
|           3 |              2 |       2 | d    |
|           3 |              2 |       3 | t    |
|           3 |              2 |       4 | V    |
|           3 |              2 |       5 | t    |
|           3 |              2 |       6 | D    |
|           3 |              2 |       7 | N    |
|           3 |              2 |       8 | m    |
|           3 |              2 |       9 | R    |
|           3 |              2 |      10 | H    |
|           3 |              2 |      11 | N    |
|           3 |              2 |      12 | V    |
|           3 |              2 |      13 | p    |
|           3 |              2 |      14 | t    |
|           3 |              2 |      15 | N    |
|           3 |              2 |      16 | D    |
|           3 |              2 |      17 | H    |
|           3 |              2 |      18 | t    |


* Part 1

Map items to their priorities

#+begin_src sqlite :db ./day03.db
  drop table if exists priorities;
  create table priorities as
         with
         items as (select distinct item from rucksacks),
         priorities(item, priority) as (select item,
         case
         when unicode(item) < unicode('a') then unicode(item) - unicode('A') + 27
         else  unicode(item) - unicode('a') + 1 end from items)
   select * from priorities
#+end_src

#+RESULTS:

#+begin_src sqlite :db ./day03.db :colnames yes :exports both
   select * from priorities order by item limit 10
#+end_src

#+RESULTS:
| item | priority |
|------+----------|
| B    |       28 |
| C    |       29 |
| D    |       30 |
| F    |       32 |
| G    |       33 |
| H    |       34 |
| J    |       36 |
| L    |       38 |
| M    |       39 |
| N    |       40 |


Find the items that appears in both compartment of each rucksacks


#+begin_src sqlite :db ./day03.db
  drop table if exists part_1_items;
  create table part_1_items as
         with items as (
  select distinct compartment_1.rucksack_id, compartment_1.item as item from rucksacks as compartment_1
         join rucksacks as compartment_2 using (rucksack_id) 
         where compartment_1.compartment_id = 1 and compartment_2.compartment_id = 2 and compartment_1.item = compartment_2.item)
         select items.item as item, priorities.priority as priority from items join priorities on  items.item = priorities.item
#+end_src

#+RESULTS:

#+begin_src sqlite :db ./day03.db :colnames yes :exports both
          select * from part_1_items limit 10
#+end_src

#+RESULTS:
| item | priority |
|------+----------|
| L    |       38 |
| L    |       38 |
| L    |       38 |
| L    |       38 |
| L    |       38 |
| L    |       38 |
| d    |        4 |
| d    |        4 |
| d    |        4 |
| d    |        4 |


Sum up the priorities for each item

#+begin_src sqlite :db ./day03.db :colnames yes :exports both
             select sum(priority) as result from part_1_items
#+end_src

#+RESULTS:
| result |
|--------|
|   8072 |

* Part 2



#+begin_src sqlite :db ./day03.db
  drop table if exists rucksack_items;
  create table rucksack_items as
         select distinct rucksack_id - 1 as id, item from rucksacks
#+end_src

#+RESULTS:

#+begin_src sqlite :db ./day03.db
  drop table if exists part_2_items;
  create table part_2_items as      
  select rucksack_1.item, priority  from rucksack_items as rucksack_1
         join rucksack_items as rucksack_2 on rucksack_1.id / 3 =  rucksack_2.id / 3 and rucksack_1.item = rucksack_2.item
         join rucksack_items as rucksack_3 on rucksack_1.id / 3 =  rucksack_3.id / 3 and rucksack_1.item = rucksack_3.item
         join priorities on rucksack_1.item = priorities.item
         where rucksack_1.id % 3 = 0 and rucksack_2.id % 3 = 1 and  rucksack_3.id % 3 = 2
#+end_src

#+RESULTS:

#+begin_src sqlite :db ./day03.db :colnames yes :exports both
          select * from part_2_items limit 10
#+end_src

#+RESULTS:
| item | priority |
|------+----------|
| W    |       49 |
| S    |       45 |
| b    |        2 |
| B    |       28 |
| m    |       13 |
| w    |       23 |
| t    |       20 |
| N    |       40 |
| j    |       10 |
| n    |       14 |

Sum up the priorities for each item

#+begin_src sqlite :db ./day03.db :colnames yes :exports both
             select sum(priority) as result from part_2_items
#+end_src

#+RESULTS:
| result |
|--------|
|   2567 |
